OpenFOAM-13/tutorials/multiRegion/CHT/reverseBurner/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0  0 0) (1  0 -0.1) (2  0 -0.2) (10  0 -1.0) (11  0 -1.1) (21  0 -2.1) (22  0 -2.2)
    (0 10 0) (1 10 -0.1) (2 10 -0.2) (10 10 -1.0) (11 10 -1.1) (21 10 -2.1) (22 10 -2.2)
    (0 40 0) (1 40 -0.1) (2 40 -0.2) (10 40 -1.0) (11 40 -1.1) (21 40 -2.1) (22 40 -2.2)
    (0 50 0) (1 50 -0.1) (2 50 -0.2) (10 50 -1.0) (11 50 -1.1) (21 50 -2.1) (22 50 -2.2)
    (0 51 0) (1 51 -0.1) (2 51 -0.2) (10 51 -1.0) (11 51 -1.1) (21 51 -2.1) (22 51 -2.2)

    (0  0 0) (1  0  0.1) (2  0  0.2) (10  0  1.0) (11  0  1.1) (21  0  2.1) (22  0  2.2)
    (0 10 0) (1 10  0.1) (2 10  0.2) (10 10  1.0) (11 10  1.1) (21 10  2.1) (22 10  2.2)
    (0 40 0) (1 40  0.1) (2 40  0.2) (10 40  1.0) (11 40  1.1) (21 40  2.1) (22 40  2.2)
    (0 50 0) (1 50  0.1) (2 50  0.2) (10 50  1.0) (11 50  1.1) (21 50  2.1) (22 50  2.2)
    (0 51 0) (1 51  0.1) (2 51  0.2) (10 51  1.0) (11 51  1.1) (21 51  2.1) (22 51  2.2)
);

blocks
(
    hex ( 0  1  8  7  0 36 43  7) gas   ( 4  40 1) simpleGrading (1 1 1)
    hex ( 1  2  9  8 36 37 44 43) solid ( 4  40 1) simpleGrading (1 1 1)
    hex ( 2  3 10  9 37 38 45 44) gas   (32  40 1) simpleGrading (1 1 1)
    hex ( 3  4 11 10 38 39 46 45) solid ( 4  40 1) simpleGrading (1 1 1)
    hex ( 4  5 12 11 39 40 47 46) gas   (40  40 1) simpleGrading (1 1 1)
    hex ( 5  6 13 12 40 41 48 47) solid ( 4  40 1) simpleGrading (1 1 1)

    hex ( 7  8 15 14  7 43 50 14) gas   ( 4 120 1) simpleGrading (1 1 1)
    hex ( 8  9 16 15 43 44 51 50) gas   ( 4 120 1) simpleGrading (1 1 1)
    hex ( 9 10 17 16 44 45 52 51) gas   (32 120 1) simpleGrading (1 1 1)
    hex (10 11 18 17 45 46 53 52) solid ( 4 120 1) simpleGrading (1 1 1)
    hex (11 12 19 18 46 47 54 53) gas   (40 120 1) simpleGrading (1 1 1)
    hex (12 13 20 19 47 48 55 54) solid ( 4 120 1) simpleGrading (1 1 1)

    hex (14 15 22 21 14 50 57 21) gas   ( 4  40 1) simpleGrading (1 1 1)
    hex (15 16 23 22 50 51 58 57) gas   ( 4  40 1) simpleGrading (1 1 1)
    hex (16 17 24 23 51 52 59 58) gas   (32  40 1) simpleGrading (1 1 1)
    hex (17 18 25 24 52 53 60 59) gas   ( 4  40 1) simpleGrading (1 1 1)
    hex (18 19 26 25 53 54 61 60) gas   (40  40 1) simpleGrading (1 1 1)
    hex (19 20 27 26 54 55 62 61) solid ( 4  40 1) simpleGrading (1 1 1)

    hex (21 22 29 28 21 57 64 28) solid ( 4   4 1) simpleGrading (1 1 1)
    hex (22 23 30 29 57 58 65 64) solid ( 4   4 1) simpleGrading (1 1 1)
    hex (23 24 31 30 58 59 66 65) solid (32   4 1) simpleGrading (1 1 1)
    hex (24 25 32 31 59 60 67 66) solid ( 4   4 1) simpleGrading (1 1 1)
    hex (25 26 33 32 60 61 68 67) solid (40   4 1) simpleGrading (1 1 1)
    hex (26 27 34 33 61 62 69 68) solid ( 4   4 1) simpleGrading (1 1 1)
);

defaultPatch
{
    name default;
    type patch;
}

boundary
(
    inletFuel
    {
        type patch;
        faces
        (
            (0 1 36 0)
        );
    }
    inletAir
    {
        type patch;
        faces
        (
            (2 3 38 37)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (4 5 40 39)
        );
    }
    external
    {
        type patch;
        faces
        (
            (1 2 37 36)
            (3 4 39 38)
            (5 6 41 40)
            (6 13 48 41)
            (13 20 55 48)
            (20 27 62 55)
            (27 34 69 62)
            (28 29 64 28)
            (29 30 65 64)
            (30 31 66 65)
            (31 32 67 66)
            (32 33 68 67)
            (33 34 69 68)
        );
    }
    wedgeNeg
    {
        type wedge;
        faces
        (
            (0 1 8 7)
            (1 2 9 8)
            (2 3 10 9)
            (3 4 11 10)
            (4 5 12 11)
            (5 6 13 12)
            (7 8 15 14)
            (8 9 16 15)
            (9 10 17 16)
            (10 11 18 17)
            (11 12 19 18)
            (12 13 20 19)
            (14 15 22 21)
            (15 16 23 22)
            (16 17 24 23)
            (17 18 25 24)
            (18 19 26 25)
            (19 20 27 26)
            (21 22 29 28)
            (22 23 30 29)
            (23 24 31 30)
            (24 25 32 31)
            (25 26 33 32)
            (26 27 34 33)
        );
    }
    wedgePos
    {
        type wedge;
        faces
        (
            (0 36 43 7)
            (36 37 44 43)
            (37 38 45 44)
            (38 39 46 45)
            (39 40 47 46)
            (40 41 48 47)
            (7 43 50 14)
            (43 44 51 50)
            (44 45 52 51)
            (45 46 53 52)
            (46 47 54 53)
            (47 48 55 54)
            (14 50 57 21)
            (50 51 58 57)
            (51 52 59 58)
            (52 53 60 59)
            (53 54 61 60)
            (54 55 62 61)
            (21 57 64 28)
            (57 58 65 64)
            (58 59 66 65)
            (59 60 67 66)
            (60 61 68 67)
            (61 62 69 68)
        );
    }
);


// ************************************************************************* //
