OpenFOAM-13/tutorials/multiRegion/CHT/reverseBurner/system/gas/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    N2  0.79;
    O2  0.21;
    CH4 0;
}

zones
{
    fuel
    {
        type        box;
        zoneType    cell;

        box         (0 0 -0.01) (0.01 0.1 0.01);

        values
        {
            N2  0;
            O2  0;
            CH4 1;
        }
    }
}

// ************************************************************************* //
